app/controllers/places_controller.rb

SELECT "places".* FROM "places" WHERE (archived != 't' OR archived IS NULL)
---
  def index
    puts '>>> index'
    puts '>>> params[:archived]'
    puts params[:archived]

    if params.has_key?(:archived) && params[:archived] == 'true'
      puts '>>> archived is true'
      @places = Place.all

INSERT INTO "places" ("archived", "come_back", "created_at", "name", "ref", "saved", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    puts '>>> params:'
    puts params.inspect
    @place = Place.new(places_create_update)
    puts '>>> place:'
    puts @place.inspect

    if @place.save

SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "places" SET "archived" = 't', "updated_at" = '2012-10-03 01:12:04.133379' WHERE "places"."id" = 2
---
  def destroy
    puts '>>> index'
    @place = Place.find(params[:id])

    puts '>>> params[:permanent]'
    puts params[:permanent]

    if params.has_key?(:permanent) && params[:permanent] == 'true'
      puts '>>> permanent is true'
      @place.destroy
    else
      @place.archived = true
      @place.save