app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "token", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 27 Sep 2012 01:46:35 UTC +00:00], ["email", nil], ["token", nil], ["updated_at", Thu, 27 Sep 2012 01:46:35 UTC +00:00]]
---
  def create
    puts '>>> params:'
    puts params.inspect
    @user = User.new(params[:user])
    puts '>>> User:'
    puts @user.inspect

    if @user.save

INSERT INTO "users" ("created_at", "email", "token", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 27 Sep 2012 02:39:52 UTC +00:00], ["email", "test@sencha.com"], ["token", nil], ["updated_at", Thu, 27 Sep 2012 02:39:52 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."email" = 'test@email.com' LIMIT 1
---
  def new_unique_user
    puts '>>> params:'
    puts params.inspect
    @user = User.find_or_create_by_email(params[:user][:email])